<!DOCTYPE html>
<html>
<body>
<div align="center">
<h3>Prepared by Asif Bhat</h3>
    
<h1>Pandas - Series & Dataframes</h1>

<h3>Follow Me on - <a href="https://www.linkedin.com/in/asif-bhat/">LinkedIn</a>&nbsp; <a href="https://mobile.twitter.com/_asifbhat_">Twitter</a>&nbsp; <a href="https://www.instagram.com/datasciencescoop/?hl=en">Instagram</a>&nbsp; <a href="https://www.facebook.com/datasciencescoop/">Facebook</a></h3>
</div>
</body>
</html>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import glob
import re
import math

# Series

## Create Series

In [2]:
# Create series from Nump Array
v = np.array([1,2,3,4,5,6,7])
s1 = pd.Series(v)
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [3]:
#Datatype of Series
s1.dtype

dtype('int64')

In [4]:
# number of bytes allocated to each item
# s1.itemsize

In [5]:
# Number of bytes consumed by Series
s1.nbytes

56

In [6]:
# Shape of the Series
s1.shape

(7,)

In [7]:
# number of dimensions
s1.ndim

1

In [8]:
# Length of Series
len(s1)

7

In [9]:
s1.count()

7

In [10]:
s1.size

7

In [11]:
# Create series from List 
s0 = pd.Series([1,2,3],index = ['a','b','c'])
s0

a    1
b    2
c    3
dtype: int64

In [12]:
# Modifying index in Series
s1.index = ['a' , 'b' , 'c' , 'd' , 'e' , 'f' , 'g']
s1

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [13]:
# Create Series using Random and Range function
v2 = np.random.random(10)
ind2 = np.arange(0,10)
s = pd.Series(v2,ind2)
v2 , ind2 , s

(array([0.09139724, 0.54560287, 0.22489591, 0.3681115 , 0.99569368,
        0.07555583, 0.70285062, 0.60940611, 0.32105073, 0.25426414]),
 array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
 0    0.091397
 1    0.545603
 2    0.224896
 3    0.368111
 4    0.995694
 5    0.075556
 6    0.702851
 7    0.609406
 8    0.321051
 9    0.254264
 dtype: float64)

In [14]:
# Creating Series from Dictionary
dict1 = {'a1' :10 , 'a2' :20 , 'a3':30 , 'a4':40}
s3 = pd.Series(dict1)
s3

a1    10
a2    20
a3    30
a4    40
dtype: int64

In [15]:
pd.Series(99, index=[0, 1, 2, 3, 4, 5])

0    99
1    99
2    99
3    99
4    99
5    99
dtype: int64

## Slicing Series

In [16]:
s

0    0.091397
1    0.545603
2    0.224896
3    0.368111
4    0.995694
5    0.075556
6    0.702851
7    0.609406
8    0.321051
9    0.254264
dtype: float64

In [17]:
# Return all elements of the series
s[:]

0    0.091397
1    0.545603
2    0.224896
3    0.368111
4    0.995694
5    0.075556
6    0.702851
7    0.609406
8    0.321051
9    0.254264
dtype: float64

In [18]:
# First three element of the Series
s[0:3]

0    0.091397
1    0.545603
2    0.224896
dtype: float64

In [19]:
# Last element of the Series
s[-1:]

9    0.254264
dtype: float64

In [20]:
# Fetch first 4 elements in a series
s[:4]

0    0.091397
1    0.545603
2    0.224896
3    0.368111
dtype: float64

In [21]:
# Return all elements of the series except last two elements.
s[:-2]

0    0.091397
1    0.545603
2    0.224896
3    0.368111
4    0.995694
5    0.075556
6    0.702851
7    0.609406
dtype: float64

In [22]:
# Return all elements of the series except last element.
s[:-1]

0    0.091397
1    0.545603
2    0.224896
3    0.368111
4    0.995694
5    0.075556
6    0.702851
7    0.609406
8    0.321051
dtype: float64

In [23]:
# Return last two elements of the series
s[-2:]

8    0.321051
9    0.254264
dtype: float64

In [24]:
# # Return last element of the series
s[-1:]

9    0.254264
dtype: float64

In [25]:
s[-3:-1]

7    0.609406
8    0.321051
dtype: float64

## Append Series

In [26]:
s2 = s1.copy()
s2

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [27]:
s3

a1    10
a2    20
a3    30
a4    40
dtype: int64

In [28]:
# Append S2 & S3 Series
s4 = s2.append(s3)
s4

a      1
b      2
c      3
d      4
e      5
f      6
g      7
a1    10
a2    20
a3    30
a4    40
dtype: int64

In [29]:
# When "inplace=False" it will return a new copy of data with the operation performed
s4.drop('a4' , inplace=False)

a      1
b      2
c      3
d      4
e      5
f      6
g      7
a1    10
a2    20
a3    30
dtype: int64

In [30]:
s4

a      1
b      2
c      3
d      4
e      5
f      6
g      7
a1    10
a2    20
a3    30
a4    40
dtype: int64

In [31]:
# When we use "inplace=True" it will affect the dataframe
s4.drop('a4', inplace=True)
s4

a      1
b      2
c      3
d      4
e      5
f      6
g      7
a1    10
a2    20
a3    30
dtype: int64

In [32]:
s4 = s4.append(pd.Series({'a4': 7}))
s4

a      1
b      2
c      3
d      4
e      5
f      6
g      7
a1    10
a2    20
a3    30
a4     7
dtype: int64

## Operation on Series

In [33]:
v1 = np.array([10,20,30])
v2 = np.array([1,2,3])
s1 = pd.Series(v1) 
s2 = pd.Series(v2)
s1 , s2

(0    10
 1    20
 2    30
 dtype: int64,
 0    1
 1    2
 2    3
 dtype: int64)

In [34]:
# Addition of two series
s1.add(s2)

0    11
1    22
2    33
dtype: int64

In [35]:
# Subtraction of two series
s1.sub(s2)

0     9
1    18
2    27
dtype: int64

In [36]:
# Subtraction of two series
s1.subtract(s2)

0     9
1    18
2    27
dtype: int64

In [37]:
# Increment all numbers in a series by 9
s1.add(9)

0    19
1    29
2    39
dtype: int64

In [38]:
# Multiplication of two series
s1.mul(s2)

0    10
1    40
2    90
dtype: int64

In [39]:
# Multiplication of two series
s1.multiply(s2)

0    10
1    40
2    90
dtype: int64

In [40]:
# Multiply each element by 1000
s1.multiply(1000)

0    10000
1    20000
2    30000
dtype: int64

In [41]:
# Division
s1.divide(s2)

0    10.0
1    10.0
2    10.0
dtype: float64

In [42]:
# Division
s1.div(s2)

0    10.0
1    10.0
2    10.0
dtype: float64

In [43]:
# MAX number in a series
s1.max()

30

In [44]:
# Min number in a series
s1.min()

10

In [45]:
# Average
s1.mean()

20.0

In [46]:
# Median
s1.median()

20.0

In [47]:
# Standard Deviation
s1.std()

10.0

In [48]:
# Series comparison
s1.equals(s2)

False

In [49]:
s4 =s1

In [50]:
# Series comparison
s1.equals(s4)

True

In [51]:
s5 = pd.Series([1,1,2,2,3,3], index=[0, 1, 2, 3, 4, 5])
s5

0    1
1    1
2    2
3    2
4    3
5    3
dtype: int64

In [52]:
s5.value_counts()

3    2
2    2
1    2
dtype: int64

# DataFrame

## Create DataFrame

In [53]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [54]:
# Create Dataframe using List
lang = ['Java' , 'Python' , 'C' , 'C++']
df = pd.DataFrame(lang)
df

        0
0    Java
1  Python
2       C
3     C++

In [55]:
# Add column in the Dataframe
rating = [1,2,3,4]
df[1] = rating
df

        0  1
0    Java  1
1  Python  2
2       C  3
3     C++  4

In [56]:
df.columns = ['Language','Rating']

In [57]:
df

  Language  Rating
0     Java       1
1   Python       2
2        C       3
3      C++       4

In [58]:
# Create Dataframe from Dictionary

data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

df2 = pd.DataFrame(data)
df3 = pd.DataFrame(data, index=['row1', 'row2'], columns=['a', 'b'])
df4 = pd.DataFrame(data, index=['row1', 'row2'], columns=['a', 'b' ,'c'])
df5 = pd.DataFrame(data, index=['row1', 'row2'], columns=['a', 'b' ,'c' , 'd'])

In [59]:
df2

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [60]:
df3

      a   b
row1  1   2
row2  5  10

In [61]:
df4

      a   b     c
row1  1   2   NaN
row2  5  10  20.0

In [62]:
df5

      a   b     c   d
row1  1   2   NaN NaN
row2  5  10  20.0 NaN

In [63]:
# Create Dataframe from Dictionary
df0 = pd.DataFrame({'ID' :[1,2,3,4] , 'Name' :['Asif' , 'Basit' , 'Ross' , 'John']})
df0

   ID   Name
0   1   Asif
1   2  Basit
2   3   Ross
3   4   John

In [64]:
# Create a DataFrame from Dictionary of Series
dict = {'A' : pd.Series([1, 2, 3],    index=['a', 'b', 'c']),
        'B' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df1 = pd.DataFrame(dict)
df1

     A  B
a  1.0  1
b  2.0  2
c  3.0  3
d  NaN  4

#### Dataframe of Random Numbers with Date Indices

In [65]:
dates = pd.date_range(start='2020-01-20', end='2020-01-26')
dates

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26'],
              dtype='datetime64[ns]', freq='D')

In [66]:
dates = pd.date_range('today',periods= 7)
dates

DatetimeIndex(['2020-05-18 16:42:22.854848', '2020-05-19 16:42:22.854848',
               '2020-05-20 16:42:22.854848', '2020-05-21 16:42:22.854848',
               '2020-05-22 16:42:22.854848', '2020-05-23 16:42:22.854848',
               '2020-05-24 16:42:22.854848'],
              dtype='datetime64[ns]', freq='D')

In [67]:
dates = pd.date_range(start='2020-01-20', periods=7)
dates

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26'],
              dtype='datetime64[ns]', freq='D')

In [68]:
M = np.random.random((7,7))
M

array([[0.56775586, 0.44012273, 0.38856336, 0.68898259, 0.08539801,
        0.50556463, 0.62922345],
       [0.61772653, 0.96368131, 0.97074479, 0.76119042, 0.98276084,
        0.32160505, 0.79725375],
       [0.04478323, 0.11084651, 0.38004565, 0.78451075, 0.26444139,
        0.36406356, 0.85348261],
       [0.69112323, 0.50583673, 0.06993112, 0.81160842, 0.1147715 ,
        0.54846468, 0.91761756],
       [0.72995546, 0.97643011, 0.30479561, 0.77786597, 0.88323014,
        0.12510406, 0.18853782],
       [0.62627351, 0.30839733, 0.69419426, 0.61727658, 0.19116576,
        0.71702641, 0.43806502],
       [0.95190409, 0.83453795, 0.95836366, 0.96821392, 0.45391789,
        0.31902079, 0.38171986]])

In [69]:
dframe = pd.DataFrame(M , index=dates)
dframe

,0,1,2,3,4,5,6
2020-01-20,0.567756,0.440123,0.388563,0.688983,0.085398,0.505565,0.629223
2020-01-21,0.617727,0.963681,0.970745,0.761190,0.982761,0.321605,0.797254
2020-01-22,0.044783,0.110847,0.380046,0.784511,0.264441,0.364064,0.853483
2020-01-23,0.691123,0.505837,0.069931,0.811608,0.114771,0.548465,0.917618
2020-01-24,0.729955,0.976430,0.304796,0.777866,0.883230,0.125104,0.188538
2020-01-25,0.626274,0.308397,0.694194,0.617277,0.191166,0.717026,0.438065
2020-01-26,0.951904,0.834538,0.958364,0.968214,0.453918,0.319021,0.381720

In [70]:
#Changing Column Names
dframe.columns = ['C1' , 'C2' , 'C3', 'C4', 'C5', 'C6', 'C7']
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.567756,0.440123,0.388563,0.688983,0.085398,0.505565,0.629223
2020-01-21,0.617727,0.963681,0.970745,0.761190,0.982761,0.321605,0.797254
2020-01-22,0.044783,0.110847,0.380046,0.784511,0.264441,0.364064,0.853483
2020-01-23,0.691123,0.505837,0.069931,0.811608,0.114771,0.548465,0.917618
2020-01-24,0.729955,0.976430,0.304796,0.777866,0.883230,0.125104,0.188538
2020-01-25,0.626274,0.308397,0.694194,0.617277,0.191166,0.717026,0.438065
2020-01-26,0.951904,0.834538,0.958364,0.968214,0.453918,0.319021,0.381720

In [71]:
# List Index
dframe.index

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26'],
              dtype='datetime64[ns]', freq='D')

In [72]:
# List Column Names
dframe.columns

Index(['C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7'], dtype='object')

In [73]:
# Datatype of each column
dframe.dtypes

C1    float64
C2    float64
C3    float64
C4    float64
C5    float64
C6    float64
C7    float64
dtype: object

In [74]:
# Sort Dataframe by Column 'C1' in Ascending Order
dframe.sort_values(by='C1')

,C1,C2,C3,C4,C5,C6,C7
2020-01-22,0.044783,0.110847,0.380046,0.784511,0.264441,0.364064,0.853483
2020-01-20,0.567756,0.440123,0.388563,0.688983,0.085398,0.505565,0.629223
2020-01-21,0.617727,0.963681,0.970745,0.761190,0.982761,0.321605,0.797254
2020-01-25,0.626274,0.308397,0.694194,0.617277,0.191166,0.717026,0.438065
2020-01-23,0.691123,0.505837,0.069931,0.811608,0.114771,0.548465,0.917618
2020-01-24,0.729955,0.976430,0.304796,0.777866,0.883230,0.125104,0.188538
2020-01-26,0.951904,0.834538,0.958364,0.968214,0.453918,0.319021,0.381720

In [75]:
# Sort Dataframe by Column 'C1' in Descending Order
dframe.sort_values(by='C1' , ascending=False)

,C1,C2,C3,C4,C5,C6,C7
2020-01-26,0.951904,0.834538,0.958364,0.968214,0.453918,0.319021,0.381720
2020-01-24,0.729955,0.976430,0.304796,0.777866,0.883230,0.125104,0.188538
2020-01-23,0.691123,0.505837,0.069931,0.811608,0.114771,0.548465,0.917618
2020-01-25,0.626274,0.308397,0.694194,0.617277,0.191166,0.717026,0.438065
2020-01-21,0.617727,0.963681,0.970745,0.761190,0.982761,0.321605,0.797254
2020-01-20,0.567756,0.440123,0.388563,0.688983,0.085398,0.505565,0.629223
2020-01-22,0.044783,0.110847,0.380046,0.784511,0.264441,0.364064,0.853483

## Delete Column in DataFrame

In [76]:
df1

     A  B
a  1.0  1
b  2.0  2
c  3.0  3
d  NaN  4

In [77]:
# Delete Column using "del" function
del df1['B']

In [78]:
df1

     A
a  1.0
b  2.0
c  3.0
d  NaN

In [79]:
df5

      a   b     c   d
row1  1   2   NaN NaN
row2  5  10  20.0 NaN

In [80]:
# Delete Column using pop()
df5.pop('c')

row1     NaN
row2    20.0
Name: c, dtype: float64

In [81]:
df5

      a   b   d
row1  1   2 NaN
row2  5  10 NaN

## Data Selection in Dataframe

In [82]:
df

  Language  Rating
0     Java       1
1   Python       2
2        C       3
3      C++       4

In [83]:
df.index = [1,2,3,4]
df

  Language  Rating
1     Java       1
2   Python       2
3        C       3
4      C++       4

In [84]:
# Data selection using row label
df.loc[1]

Language    Java
Rating         1
Name: 1, dtype: object

In [85]:
# Data selection using position (Integer Index based)
df.iloc[1]

Language    Python
Rating           2
Name: 2, dtype: object

In [86]:
df.loc[1:2]

  Language  Rating
1     Java       1
2   Python       2

In [87]:
df.iloc[1:2]

  Language  Rating
2   Python       2

In [88]:
# Data selection based on Condition
df.loc[df.Rating > 2]

  Language  Rating
3        C       3
4      C++       4

In [89]:
df1

     A
a  1.0
b  2.0
c  3.0
d  NaN

In [90]:
# Row & Column label based selection
df1.loc['a']

A    1.0
Name: a, dtype: float64

In [91]:
# df1.iloc['a'] # This will throw error because iloc will not work on labels

In [92]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.567756,0.440123,0.388563,0.688983,0.085398,0.505565,0.629223
2020-01-21,0.617727,0.963681,0.970745,0.761190,0.982761,0.321605,0.797254
2020-01-22,0.044783,0.110847,0.380046,0.784511,0.264441,0.364064,0.853483
2020-01-23,0.691123,0.505837,0.069931,0.811608,0.114771,0.548465,0.917618
2020-01-24,0.729955,0.976430,0.304796,0.777866,0.883230,0.125104,0.188538
2020-01-25,0.626274,0.308397,0.694194,0.617277,0.191166,0.717026,0.438065
2020-01-26,0.951904,0.834538,0.958364,0.968214,0.453918,0.319021,0.381720

In [93]:
# Data selection using Row Label
dframe['2020-01-20' : '2020-01-22' ]

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.567756,0.440123,0.388563,0.688983,0.085398,0.505565,0.629223
2020-01-21,0.617727,0.963681,0.970745,0.761190,0.982761,0.321605,0.797254
2020-01-22,0.044783,0.110847,0.380046,0.784511,0.264441,0.364064,0.853483

In [94]:
# Selecting all rows & selected columns
dframe.loc[:,['C1' , 'C7']]

                  C1        C7
2020-01-20  0.567756  0.629223
2020-01-21  0.617727  0.797254
2020-01-22  0.044783  0.853483
2020-01-23  0.691123  0.917618
2020-01-24  0.729955  0.188538
2020-01-25  0.626274  0.438065
2020-01-26  0.951904  0.381720

In [95]:
#row & column label based selection
dframe.loc['2020-01-20' : '2020-01-22',['C1' , 'C7']]

                  C1        C7
2020-01-20  0.567756  0.629223
2020-01-21  0.617727  0.797254
2020-01-22  0.044783  0.853483

In [96]:
# Data selection based on Condition
dframe[dframe['C1'] > 0.5]

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.567756,0.440123,0.388563,0.688983,0.085398,0.505565,0.629223
2020-01-21,0.617727,0.963681,0.970745,0.761190,0.982761,0.321605,0.797254
2020-01-23,0.691123,0.505837,0.069931,0.811608,0.114771,0.548465,0.917618
2020-01-24,0.729955,0.976430,0.304796,0.777866,0.883230,0.125104,0.188538
2020-01-25,0.626274,0.308397,0.694194,0.617277,0.191166,0.717026,0.438065
2020-01-26,0.951904,0.834538,0.958364,0.968214,0.453918,0.319021,0.381720

In [97]:
# Data selection based on Condition
dframe[(dframe['C1'] > 0.5) & (dframe['C4'] > 0.5)]

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,0.567756,0.440123,0.388563,0.688983,0.085398,0.505565,0.629223
2020-01-21,0.617727,0.963681,0.970745,0.761190,0.982761,0.321605,0.797254
2020-01-23,0.691123,0.505837,0.069931,0.811608,0.114771,0.548465,0.917618
2020-01-24,0.729955,0.976430,0.304796,0.777866,0.883230,0.125104,0.188538
2020-01-25,0.626274,0.308397,0.694194,0.617277,0.191166,0.717026,0.438065
2020-01-26,0.951904,0.834538,0.958364,0.968214,0.453918,0.319021,0.381720

In [98]:
# Data selection using position (Integer Index based)
dframe.iloc[0][0]

0.5677558640443788

In [99]:
# Select all rows & first three columns
dframe.iloc[:,0:3]

                  C1        C2        C3
2020-01-20  0.567756  0.440123  0.388563
2020-01-21  0.617727  0.963681  0.970745
2020-01-22  0.044783  0.110847  0.380046
2020-01-23  0.691123  0.505837  0.069931
2020-01-24  0.729955  0.976430  0.304796
2020-01-25  0.626274  0.308397  0.694194
2020-01-26  0.951904  0.834538  0.958364

In [100]:
dframe.iloc[0][0] = 10

In [101]:
# Display all rows where C1 has value of 10 or 20
dframe[dframe['C1'].isin([10,20])]

              C1        C2        C3        C4        C5        C6        C7
2020-01-20  10.0  0.440123  0.388563  0.688983  0.085398  0.505565  0.629223

## Set Value

In [102]:
# Set value of 888 for all elements in column 'C1'
dframe['C1'] = 888
dframe

             C1        C2        C3        C4        C5        C6        C7
2020-01-20  888  0.440123  0.388563  0.688983  0.085398  0.505565  0.629223
2020-01-21  888  0.963681  0.970745  0.761190  0.982761  0.321605  0.797254
2020-01-22  888  0.110847  0.380046  0.784511  0.264441  0.364064  0.853483
2020-01-23  888  0.505837  0.069931  0.811608  0.114771  0.548465  0.917618
2020-01-24  888  0.976430  0.304796  0.777866  0.883230  0.125104  0.188538
2020-01-25  888  0.308397  0.694194  0.617277  0.191166  0.717026  0.438065
2020-01-26  888  0.834538  0.958364  0.968214  0.453918  0.319021  0.381720

In [103]:
# Set value of 777 for first three rows in Column 'C6'
dframe.at[0:3,'C6'] = 777

In [104]:
dframe

             C1        C2        C3        C4        C5          C6        C7
2020-01-20  888  0.440123  0.388563  0.688983  0.085398  777.000000  0.629223
2020-01-21  888  0.963681  0.970745  0.761190  0.982761  777.000000  0.797254
2020-01-22  888  0.110847  0.380046  0.784511  0.264441  777.000000  0.853483
2020-01-23  888  0.505837  0.069931  0.811608  0.114771    0.548465  0.917618
2020-01-24  888  0.976430  0.304796  0.777866  0.883230    0.125104  0.188538
2020-01-25  888  0.308397  0.694194  0.617277  0.191166    0.717026  0.438065
2020-01-26  888  0.834538  0.958364  0.968214  0.453918    0.319021  0.381720

In [105]:
# Set value of 333 in first row and third column
dframe.iat[0,2] = 333

In [106]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.440123,333.000000,0.688983,0.085398,777.000000,0.629223
2020-01-21,888,0.963681,0.970745,0.761190,0.982761,777.000000,0.797254
2020-01-22,888,0.110847,0.380046,0.784511,0.264441,777.000000,0.853483
2020-01-23,888,0.505837,0.069931,0.811608,0.114771,0.548465,0.917618
2020-01-24,888,0.976430,0.304796,0.777866,0.883230,0.125104,0.188538
2020-01-25,888,0.308397,0.694194,0.617277,0.191166,0.717026,0.438065
2020-01-26,888,0.834538,0.958364,0.968214,0.453918,0.319021,0.381720

In [107]:
dframe.iloc[0,2] = 555
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.440123,555.000000,0.688983,0.085398,777.000000,0.629223
2020-01-21,888,0.963681,0.970745,0.761190,0.982761,777.000000,0.797254
2020-01-22,888,0.110847,0.380046,0.784511,0.264441,777.000000,0.853483
2020-01-23,888,0.505837,0.069931,0.811608,0.114771,0.548465,0.917618
2020-01-24,888,0.976430,0.304796,0.777866,0.883230,0.125104,0.188538
2020-01-25,888,0.308397,0.694194,0.617277,0.191166,0.717026,0.438065
2020-01-26,888,0.834538,0.958364,0.968214,0.453918,0.319021,0.381720

In [108]:
# Create Copy of the calling objects data along with indices.
# Modifications to the data or indices of the copy will not be reflected in the original object 
dframe1 = dframe.copy(deep=True)

In [109]:
dframe1[(dframe1['C1'] > 0.5) & (dframe1['C4'] > 0.5)] = 0

In [110]:
dframe1[dframe1['C1'] == 0]

            C1   C2   C3   C4   C5   C6   C7
2020-01-20   0  0.0  0.0  0.0  0.0  0.0  0.0
2020-01-21   0  0.0  0.0  0.0  0.0  0.0  0.0
2020-01-22   0  0.0  0.0  0.0  0.0  0.0  0.0
2020-01-23   0  0.0  0.0  0.0  0.0  0.0  0.0
2020-01-24   0  0.0  0.0  0.0  0.0  0.0  0.0
2020-01-25   0  0.0  0.0  0.0  0.0  0.0  0.0
2020-01-26   0  0.0  0.0  0.0  0.0  0.0  0.0

In [111]:
# Replace zeros in Column C1 with 99
dframe1[dframe1['C1'].isin([0])] = 99
dframe1

            C1    C2    C3    C4    C5    C6    C7
2020-01-20  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-21  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-22  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-23  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-24  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-25  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-26  99  99.0  99.0  99.0  99.0  99.0  99.0

In [112]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.440123,555.000000,0.688983,0.085398,777.000000,0.629223
2020-01-21,888,0.963681,0.970745,0.761190,0.982761,777.000000,0.797254
2020-01-22,888,0.110847,0.380046,0.784511,0.264441,777.000000,0.853483
2020-01-23,888,0.505837,0.069931,0.811608,0.114771,0.548465,0.917618
2020-01-24,888,0.976430,0.304796,0.777866,0.883230,0.125104,0.188538
2020-01-25,888,0.308397,0.694194,0.617277,0.191166,0.717026,0.438065
2020-01-26,888,0.834538,0.958364,0.968214,0.453918,0.319021,0.381720

In [113]:
# Display all rows where value of C1 is 99
dframe1[dframe1['C1'] == 99]

            C1    C2    C3    C4    C5    C6    C7
2020-01-20  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-21  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-22  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-23  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-24  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-25  99  99.0  99.0  99.0  99.0  99.0  99.0
2020-01-26  99  99.0  99.0  99.0  99.0  99.0  99.0

## Dealing with NULL Values

In [114]:
dframe.at[0:8 , 'C7'] = np.NaN
dframe.at[0:2 , 'C6'] = np.NaN
dframe.at[5:6 , 'C5'] = np.NaN
dframe

             C1        C2          C3        C4        C5          C6  C7
2020-01-20  888  0.440123  555.000000  0.688983  0.085398         NaN NaN
2020-01-21  888  0.963681    0.970745  0.761190  0.982761         NaN NaN
2020-01-22  888  0.110847    0.380046  0.784511  0.264441  777.000000 NaN
2020-01-23  888  0.505837    0.069931  0.811608  0.114771    0.548465 NaN
2020-01-24  888  0.976430    0.304796  0.777866  0.883230    0.125104 NaN
2020-01-25  888  0.308397    0.694194  0.617277       NaN    0.717026 NaN
2020-01-26  888  0.834538    0.958364  0.968214  0.453918    0.319021 NaN

In [115]:
# Detect Non-Missing Values
# It will return True for NOT-NULL values and False for NULL values
dframe.notna()

              C1    C2    C3    C4     C5     C6     C7
2020-01-20  True  True  True  True   True  False  False
2020-01-21  True  True  True  True   True  False  False
2020-01-22  True  True  True  True   True   True  False
2020-01-23  True  True  True  True   True   True  False
2020-01-24  True  True  True  True   True   True  False
2020-01-25  True  True  True  True  False   True  False
2020-01-26  True  True  True  True   True   True  False

In [116]:
# Detect Missing or NULL Values
# It will return True for NULL values and False for NOT-NULL values
dframe.isna()

               C1     C2     C3     C4     C5     C6    C7
2020-01-20  False  False  False  False  False   True  True
2020-01-21  False  False  False  False  False   True  True
2020-01-22  False  False  False  False  False  False  True
2020-01-23  False  False  False  False  False  False  True
2020-01-24  False  False  False  False  False  False  True
2020-01-25  False  False  False  False   True  False  True
2020-01-26  False  False  False  False  False  False  True

In [117]:
# Fill all NULL values with 1020
dframe = dframe.fillna(1020)
dframe

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.440123,555.000000,0.688983,0.085398,1020.000000,1020.0
2020-01-21,888,0.963681,0.970745,0.761190,0.982761,1020.000000,1020.0
2020-01-22,888,0.110847,0.380046,0.784511,0.264441,777.000000,1020.0
2020-01-23,888,0.505837,0.069931,0.811608,0.114771,0.548465,1020.0
2020-01-24,888,0.976430,0.304796,0.777866,0.883230,0.125104,1020.0
2020-01-25,888,0.308397,0.694194,0.617277,1020.000000,0.717026,1020.0
2020-01-26,888,0.834538,0.958364,0.968214,0.453918,0.319021,1020.0

In [118]:
dframe.at[0:5 , 'C7'] = np.NaN
dframe.at[0:2 , 'C6'] = np.NaN
dframe.at[5:6 , 'C5'] = np.NaN
dframe

             C1        C2          C3        C4        C5          C6      C7
2020-01-20  888  0.440123  555.000000  0.688983  0.085398         NaN     NaN
2020-01-21  888  0.963681    0.970745  0.761190  0.982761         NaN     NaN
2020-01-22  888  0.110847    0.380046  0.784511  0.264441  777.000000     NaN
2020-01-23  888  0.505837    0.069931  0.811608  0.114771    0.548465     NaN
2020-01-24  888  0.976430    0.304796  0.777866  0.883230    0.125104     NaN
2020-01-25  888  0.308397    0.694194  0.617277       NaN    0.717026  1020.0
2020-01-26  888  0.834538    0.958364  0.968214  0.453918    0.319021  1020.0

In [119]:
# Replace Null values in Column 'C5' with number 123
# Replace Null values in Column 'C6' with number 789
dframe.fillna(value={'C5' : 123 , 'C6' : 789})

,C1,C2,C3,C4,C5,C6,C7
2020-01-20,888,0.440123,555.000000,0.688983,0.085398,789.000000,NaN
2020-01-21,888,0.963681,0.970745,0.761190,0.982761,789.000000,NaN
2020-01-22,888,0.110847,0.380046,0.784511,0.264441,777.000000,NaN
2020-01-23,888,0.505837,0.069931,0.811608,0.114771,0.548465,NaN
2020-01-24,888,0.976430,0.304796,0.777866,0.883230,0.125104,NaN
2020-01-25,888,0.308397,0.694194,0.617277,123.000000,0.717026,1020.0
2020-01-26,888,0.834538,0.958364,0.968214,0.453918,0.319021,1020.0

In [120]:
#Replace first NULL value in Column C7 with 789
dframe.fillna(value={'C7' : 789} , limit=1)

             C1        C2          C3        C4        C5          C6      C7
2020-01-20  888  0.440123  555.000000  0.688983  0.085398         NaN   789.0
2020-01-21  888  0.963681    0.970745  0.761190  0.982761         NaN     NaN
2020-01-22  888  0.110847    0.380046  0.784511  0.264441  777.000000     NaN
2020-01-23  888  0.505837    0.069931  0.811608  0.114771    0.548465     NaN
2020-01-24  888  0.976430    0.304796  0.777866  0.883230    0.125104     NaN
2020-01-25  888  0.308397    0.694194  0.617277       NaN    0.717026  1020.0
2020-01-26  888  0.834538    0.958364  0.968214  0.453918    0.319021  1020.0

In [121]:
# Drop Rows with NULL values
dframe.dropna()

             C1        C2        C3        C4        C5        C6      C7
2020-01-26  888  0.834538  0.958364  0.968214  0.453918  0.319021  1020.0

In [122]:
# Drop Columns with NULL values
dframe.dropna(axis='columns')

             C1        C2          C3        C4
2020-01-20  888  0.440123  555.000000  0.688983
2020-01-21  888  0.963681    0.970745  0.761190
2020-01-22  888  0.110847    0.380046  0.784511
2020-01-23  888  0.505837    0.069931  0.811608
2020-01-24  888  0.976430    0.304796  0.777866
2020-01-25  888  0.308397    0.694194  0.617277
2020-01-26  888  0.834538    0.958364  0.968214

In [123]:
dframe

             C1        C2          C3        C4        C5          C6      C7
2020-01-20  888  0.440123  555.000000  0.688983  0.085398         NaN     NaN
2020-01-21  888  0.963681    0.970745  0.761190  0.982761         NaN     NaN
2020-01-22  888  0.110847    0.380046  0.784511  0.264441  777.000000     NaN
2020-01-23  888  0.505837    0.069931  0.811608  0.114771    0.548465     NaN
2020-01-24  888  0.976430    0.304796  0.777866  0.883230    0.125104     NaN
2020-01-25  888  0.308397    0.694194  0.617277       NaN    0.717026  1020.0
2020-01-26  888  0.834538    0.958364  0.968214  0.453918    0.319021  1020.0

In [124]:
# Drop Rows with NULL values present in C5 or C6
dframe.dropna(subset=['C5' ,'C6'])

             C1        C2        C3        C4        C5          C6      C7
2020-01-22  888  0.110847  0.380046  0.784511  0.264441  777.000000     NaN
2020-01-23  888  0.505837  0.069931  0.811608  0.114771    0.548465     NaN
2020-01-24  888  0.976430  0.304796  0.777866  0.883230    0.125104     NaN
2020-01-26  888  0.834538  0.958364  0.968214  0.453918    0.319021  1020.0

## Descriptive Statistics

In [125]:
# Fill NULL values with 55
dframe.fillna(55 , inplace=True)
dframe

             C1        C2          C3        C4         C5          C6      C7
2020-01-20  888  0.440123  555.000000  0.688983   0.085398   55.000000    55.0
2020-01-21  888  0.963681    0.970745  0.761190   0.982761   55.000000    55.0
2020-01-22  888  0.110847    0.380046  0.784511   0.264441  777.000000    55.0
2020-01-23  888  0.505837    0.069931  0.811608   0.114771    0.548465    55.0
2020-01-24  888  0.976430    0.304796  0.777866   0.883230    0.125104    55.0
2020-01-25  888  0.308397    0.694194  0.617277  55.000000    0.717026  1020.0
2020-01-26  888  0.834538    0.958364  0.968214   0.453918    0.319021  1020.0

In [126]:
# Mean of all Columns
dframe.mean()

C1    888.000000
C2      0.591408
C3     79.768296
C4      0.772807
C5      8.254931
C6    126.958517
C7    330.714286
dtype: float64

In [127]:
# Max value per column
dframe.max()

C1     888.000000
C2       0.976430
C3     555.000000
C4       0.968214
C5      55.000000
C6     777.000000
C7    1020.000000
dtype: float64

In [128]:
# Min value per column
dframe.min()

C1    888.000000
C2      0.110847
C3      0.069931
C4      0.617277
C5      0.085398
C6      0.125104
C7     55.000000
dtype: float64

In [129]:
# Median 
dframe.median()

C1    888.000000
C2      0.505837
C3      0.694194
C4      0.777866
C5      0.453918
C6      0.717026
C7     55.000000
dtype: float64

In [130]:
dframe.std() #Standard Deviation

C1      0.000000
C2      0.338424
C3    209.557755
C4      0.108937
C5     20.615670
C6    287.793525
C7    470.871785
dtype: float64

In [131]:
dframe.var()  #Variance

C1         0.000000
C2         0.114531
C3     43914.452853
C4         0.011867
C5       425.005851
C6     82825.112978
C7    221720.238095
dtype: float64

In [132]:
#Lower Quartile / First Quartile
dframe.quantile(0.25)

C1    888.000000
C2      0.374260
C3      0.342421
C4      0.725087
C5      0.189606
C6      0.433743
C7     55.000000
Name: 0.25, dtype: float64

In [133]:
#Second Quartile / Median
dframe.quantile(0.50)

C1    888.000000
C2      0.505837
C3      0.694194
C4      0.777866
C5      0.453918
C6      0.717026
C7     55.000000
Name: 0.5, dtype: float64

In [134]:
# Upper Quartile
dframe.quantile(0.75)

C1    888.000000
C2      0.899110
C3      0.964554
C4      0.798060
C5      0.932995
C6     55.000000
C7    537.500000
Name: 0.75, dtype: float64

In [135]:
 #IQR (Interquartile Range)
dframe.quantile(0.75) - dframe.quantile(0.25)

C1      0.000000
C2      0.524850
C3      0.622134
C4      0.072973
C5      0.743389
C6     54.566257
C7    482.500000
dtype: float64

In [136]:
# SUM of column values
dframe.sum()

C1    6216.000000
C2       4.139853
C3     558.378075
C4       5.409649
C5      57.784520
C6     888.709616
C7    2315.000000
dtype: float64

In [137]:
# GENERATES DESCRIPTIVE STATS
dframe.describe()

,C1,C2,C3,C4,C5,C6,C7
count,7.0,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000
mean,888.0,0.591408,79.768296,0.772807,8.254931,126.958517,330.714286
std,0.0,0.338424,209.557755,0.108937,20.615670,287.793525,470.871785
min,888.0,0.110847,0.069931,0.617277,0.085398,0.125104,55.000000
25%,888.0,0.374260,0.342421,0.725087,0.189606,0.433743,55.000000
50%,888.0,0.505837,0.694194,0.777866,0.453918,0.717026,55.000000
75%,888.0,0.899110,0.964554,0.798060,0.932995,55.000000,537.500000
max,888.0,0.976430,555.000000,0.968214,55.000000,777.000000,1020.000000

In [138]:
#Return unbiased skew
# https://www.youtube.com/watch?v=HnMGKsupF8Q
dframe.skew()

C1    0.000000
C2   -0.088467
C3    2.645737
C4    0.571930
C5    2.644120
C6    2.602174
C7    1.229634
dtype: float64

In [139]:
# Return unbiased kurtosis using Fishers definition of kurtosis
# https://www.youtube.com/watch?v=HnMGKsupF8Q
dframe.kurt()

C1    0.000000
C2   -1.664414
C3    6.999942
C4    1.541586
C5    6.993404
C6    6.819781
C7   -0.840000
dtype: float64

In [140]:
#Correlation
# https://www.youtube.com/watch?v=qtaqvPAeEJY&list=PLblh5JKOoLUK0FLuzwntyYI10UQFUhsY9&index=10
# https://www.youtube.com/watch?v=xZ_z8KWkhXE&list=PLblh5JKOoLUK0FLuzwntyYI10UQFUhsY9&index=11
dframe.corr()

    C1        C2        C3        C4        C5        C6        C7
C1 NaN       NaN       NaN       NaN       NaN       NaN       NaN
C2 NaN  1.000000 -0.196553  0.419917 -0.355918 -0.618377 -0.040250
C3 NaN -0.196553  1.000000 -0.339092 -0.174454 -0.110586 -0.257340
C4 NaN  0.419917 -0.339092  1.000000 -0.628731  0.020293  0.125031
C5 NaN -0.355918 -0.174454 -0.628731  1.000000 -0.197545  0.645234
C6 NaN -0.618377 -0.110586  0.020293 -0.197545  1.000000 -0.300129
C7 NaN -0.040250 -0.257340  0.125031  0.645234 -0.300129  1.000000

In [ ]:
#Covariance
# https://www.youtube.com/watch?v=qtaqvPAeEJY&list=PLblh5JKOoLUK0FLuzwntyYI10UQFUhsY9&index=10
# https://www.youtube.com/watch?v=xZ_z8KWkhXE&list=PLblh5JKOoLUK0FLuzwntyYI10UQFUhsY9&index=11
dframe.cov()

In [ ]:
import statistics as st
dframe.at[3:6,'C1'] = 22
dframe

In [ ]:
# Average 
st.mean(dframe['C1'])

In [ ]:
# Hormonic Mean
st.harmonic_mean(dframe['C1'])

In [ ]:
#Returns average of the two middle numbers when length is EVEN
arr = np.array([1,2,3,4,5,6,7,8])
st.median(arr)

In [ ]:
# low median of the data with EVEN length
st.median_low(arr)

In [ ]:
# High median of the data with EVEN length
st.median_high(arr)

In [ ]:
# Mode of Dataset
st.mode(dframe['C7'])

In [ ]:
# Sample Variance
st.variance(dframe['C1'])

In [ ]:
#Population Variance
st.pvariance(dframe['C1'])

In [ ]:
#Sample  Standard Deviation
st.stdev(dframe['C1'])

In [ ]:
#Population Standard Deviation
st.pstdev(dframe['C1'])

## Apply function on Dataframe

In [ ]:
dframe

In [ ]:
# Finding MAX value in Columns
dframe.apply(max)

In [ ]:
# Finding minimum value in Columns
dframe.apply(min)

In [ ]:
#Sum of Column Values
dframe.apply(sum)

In [ ]:
#Sum of Column Values
dframe.apply(np.sum)

In [ ]:
# Sum of rows
dframe.apply(np.sum ,axis=1)

In [ ]:
# Square root of all values in a DataFrame
dframe.applymap(np.sqrt)

In [ ]:
# Square root of all values in a DataFrame
dframe.applymap(math.sqrt)

In [ ]:
dframe.applymap(float)

In [ ]:
# Using Lambda function in Dataframes
dframe.apply(lambda x: min(x))

In [ ]:
# Using Lambda function in Dataframes
dframe.apply(lambda x: x*x)

# Merge Dataframes

In [ ]:
daf1 =  pd.DataFrame ({'id': ['1', '2', '3', '4', '5'], 'Name': ['Asif', 'Basit', 'Bran', 'John', 'David']})
daf1

In [ ]:
daf2 =  pd.DataFrame ({'id': ['1', '2', '6', '7', '8'], 'Score': [40 , 60 , 80 , 90 , 70]})
daf2

In [ ]:
# Inner Join
pd.merge(daf1, daf2, on='id', how='inner')

In [ ]:
# Full Outer Join
pd.merge(daf1, daf2, on='id', how='outer')

In [ ]:
# Left Outer Join
pd.merge(daf1, daf2, on='id', how='left')

In [ ]:
#Right Outer Join
pd.merge(daf1, daf2, on='id', how='right')

# Importing multiple CSV files in DataFrame
> https://github.com/CSSEGISandData/COVID-19/tree/master/csse_covid_19_data/csse_covid_19_daily_reports

In [ ]:
# Append all CSV files 
path =r'C:\Users\DELL\Documents\GitHub\Public\COVID-19\csse_covid_19_data\`'
filenames = glob.glob(path + "/*.csv")
covid = pd.DataFrame()
for f in filenames:
    df = pd.read_csv(f)
    covid = covid.append(df,ignore_index=True,sort=True)

In [ ]:
# Top 10 rows of the Dataframe
covid.head(10)

In [ ]:
# Bottom 10 rows of the Dataframe
covid.tail(10)

In [ ]:
# Reading columns
covid['Country/Region'].head(10)

In [ ]:
# Reading columns
df1 = covid[['Country/Region' ,'Province/State','Confirmed' , 'Last Update']]
df1.head(10)

In [ ]:
#Read specific rows 
df1.iloc[1:4]

In [ ]:
#Filter data 
df1.loc[df1['Country/Region']== 'India']

In [ ]:
#Sort Data Frame
display('Sorted Data Frame', df1.sort_values(['Country/Region'], ascending=True).head(5))

In [ ]:
#Sort Data Frame
display('Sorted Data Frame', df1.sort_values(['Country/Region'], ascending=False).head(5))

In [ ]:
#Sort Data Frame - Ascending on "Country" & descending on "Last update"
display('Sorted Data Frame', df1.sort_values(['Country/Region', 'Last Update'], ascending=[1,0]).head(5))

In [ ]:
#Iterating through the dataset
for index , row in df1.iterrows():
    if (row['Country/Region'] == 'Indonesia' ):
        display(row[['Country/Region' ,'Confirmed']])

In [ ]:
#Unique Values
covid['Country/Region'].drop_duplicates(keep='first').head(10)

In [ ]:
# Countries impacted with Coronavirus
countries = covid['Country/Region'].unique()
type(countries) , countries

In [ ]:
df2 = pd.read_csv('Pokemon.csv')
df2.head(5)

In [ ]:
# Sum of Columns 
df2['Total'] = df2['HP'] + df2['Attack']
df2.head(5)

In [ ]:
# Sum of Columns 
df2['Total'] = df2.iloc[:,4:10].sum(axis=1)
df2.head(5)

In [ ]:
#Shifting "Total" column

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

In [ ]:
#Shifting "Legendary" column -  Index location -1 or 12

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

In [ ]:
#Shifting "Generation" column - Index location -1 or 12

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[12]] + cols[10:12]]
df2.head(5)

In [ ]:
#Save to CSV file

df2.to_csv('poke_updated.csv')

In [ ]:
#Save to CSV file without index column

df2.to_csv('poke_updated1.csv', index=False)

In [ ]:
df2.head(10)

In [ ]:
# Save Dataframe as text file
df2.to_csv('poke.txt' , sep='\t' , index=False)

In [ ]:
# Save Dataframe as xlsx file
df2.to_excel('poke.xlsx')

In [ ]:
# Save Dataframe as xlsx file without row names
df2.to_excel('poke.xlsx', index=0)

In [ ]:
#Filtering using loc

df2.loc[df2['Type 2'] == 'Dragon']

In [ ]:
#Filtering using loc
df3 = df2.loc[(df2['Type 2'] == 'Dragon') & (df2['Type 1'] == 'Dark')]
df3

In [ ]:
#Reset index for Dataframe df3 keeping old index column

df4 = df3.reset_index()
df4

In [ ]:
#Reset index for Dataframe df3 removing old index column

df3.reset_index(drop=True , inplace=True)
df3

In [ ]:
df2.head(10)

# LIKE OPERATION IN PANDAS

In [ ]:
df2.Name.str.contains("rill").head(10)

In [ ]:
# Display all rows containing Name "rill"
df2.loc[df2.Name.str.contains("rill")]

In [ ]:
# Exclude all rows containing "rill"
df2.loc[~df2.Name.str.contains("rill")].head(10)

In [ ]:
#Display all rows with Type-1 as "Grass" and Type-2 as "Poison"

df2.loc[df2['Type 1'].str.contains("Grass") & df2['Type 2'].str.contains("Poison")]

In [ ]:
df2.loc[df2['Type 1'].str.contains('Grass|Water',regex = True)].head(10)

In [ ]:
# Due to Case-sensitive it will not return any data

df2.loc[df2['Type 1'].str.contains('grass|water',regex = True)].head(10)

In [ ]:
# To ignore case we can use "case = False"

df2.loc[df2['Type 1'].str.contains('grass|water', case = False ,regex = True)].head(10)

In [ ]:
# To ignore case we can use "Flags = re.I"

df2.loc[df2['Type 1'].str.contains('grass|water',flags = re.I ,regex = True)].head(10)

# Regex in Pandas dataframe

In [ ]:
#Get all rows with name starting with "wa"

df2.loc[df2.Name.str.contains('^Wa',flags = re.I ,regex = True)].head(10)

In [ ]:
#Get all rows with name starting with "wa" followed by any letter between a-l

df2.loc[df2.Name.str.contains('^Wa[a-l]+',flags = re.I ,regex = True)].head(10)

In [ ]:
#Get all rows with name starting with x , y, z

df2.loc[df2.Name.str.contains('^[x-z]',flags = re.I ,regex = True)]

In [ ]:
# Extracting first 3 characters from "Name" column
df2['Name2'] = df2.Name.str.extract(r'(^\w{3})')

In [ ]:
df2.head(5)

In [ ]:
# Return all rows with "Name" starting with character 'B or b' 
df2.loc[df2.Name.str.match(r'(^[B|b].*)')].head(5)

# Replace values in dataframe

In [ ]:
df2.head(10)

In [ ]:
df2['Type 1'] = df2['Type 1'].replace({"Grass" : "Meadow" , "Fire" :"Blaze"})

In [ ]:
df2.head(10)

In [ ]:
df2['Type 2'] = df2['Type 2'].replace({"Poison" : "Venom"})

In [ ]:
df2.head(5)

In [ ]:
df2['Type 2'] = df2['Type 2'].replace(['Venom' , 'Dragon'] , 'DANGER')

In [ ]:
df2.head(10)

In [ ]:
df2.loc[df2['Type 2'] == 'DANGER' , 'Name2'] = np.NaN

In [ ]:
df2.head(10)

In [ ]:
df2.loc[df2['Total'] > 400 , ['Name2' , 'Legendary']] = 'ALERT'
df2.head(10)

In [ ]:
df2.loc[df2['Total'] > 400 , ['Legendary' , 'Name2']] = ['ALERT-1' , 'ALERT-2'] 
df2.head(10)

# Group By

In [ ]:
df = pd.read_csv('poke_updated1.csv')
df.head(5)

In [ ]:
df.groupby(['Type 1']).mean().head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Attack' , ascending = False).head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Defense' , ascending = False).head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Speed' , ascending = False).head(10)

In [ ]:
df.sum()

In [ ]:
df.groupby(['Type 2']).sum().head(5)

In [ ]:
df.count()

In [ ]:
df['count1'] = 0
df.groupby(['Type 2']).count()['count1']

In [ ]:
df['count1'] = 0
df.groupby(['Type 1']).count()['count1']

In [ ]:
df['count1'] = 0
df.groupby(['Type 1' , 'Type 2' , 'Legendary']).count()['count1']

# Loading Data in Chunks

In [ ]:
for df in pd.read_csv('poke_updated1.csv', chunksize=10):
    print(df)

In [ ]:
df

In [ ]:
df1 = pd.DataFrame()
for df in pd.read_csv('poke_updated1.csv', chunksize=10):
    df1 = pd.concat([df1 ,df])
df1.head(15)

# Stack & unstack in Pandas

In [ ]:
col = pd.MultiIndex.from_product([['2010','2015'],['Literacy' , 'GDP']])

data =([[80,7,88,6],[90,8,92,7],[89,7,91,8],[87,6,93,8]])

df6 = pd.DataFrame(data, index=['India','USA' , 'Russia' , 'China'], columns=col)
df6

In [ ]:
# Stack() Function stacks the columns to rows.
st_df = df6.stack()
st_df

In [ ]:
#Unstacks the row to columns
unst_df = st_df.unstack()
unst_df

In [ ]:
unst_df = unst_df.unstack()
unst_df

In [ ]:
unst_df = unst_df.unstack()
unst_df

# PIVOT Tables

In [ ]:
data = {
    'Country':['India','USA' , 'Russia' , 'China','India','USA' , 'Russia' , 'China','India','USA' , 'Russia' , 'China','India','USA' , 'Russia' , 'China'],
    'Year':['2010','2010','2010','2010' , '2010','2010','2010','2010','2015','2015','2015','2015','2015','2015','2015','2015'],
     
    'Literacy/GDP':['GDP' , 'GDP' , 'GDP' , 'GDP','Literacy' , 'Literacy', 'Literacy' , 'Literacy','GDP' , 'GDP','GDP' , 'GDP','Literacy' , 'Literacy','Literacy' , 'Literacy'],
   'Value':[7,8,7,6,80,90,89,87,6,7,8, 8, 88 , 92 , 91 ,93]}
 
df7 = pd.DataFrame(data,columns=['Country','Year','Literacy/GDP','Value'])
df7

In [ ]:
# Pivot table with SUM aggregation
pd.pivot_table(df7 , index= ['Year' , 'Literacy/GDP'] , aggfunc='sum')

In [ ]:
# Pivot table with MEAN aggregation
pd.pivot_table(df7 , index= ['Year' , 'Literacy/GDP'] , aggfunc='mean')

# Hierarchical indexing

In [ ]:
df7

In [ ]:
df8=df7.set_index(['Year', 'Literacy/GDP'])
df8

In [ ]:
df8.index

In [ ]:
df8.loc['2010']

In [ ]:
df8.loc[['2010']]

In [ ]:
df8.loc['2015','Literacy']

In [ ]:
df8.loc['2015','Literacy']

In [ ]:
df8=df7.set_index(['Year', 'Literacy/GDP' , 'Country'])
df8

### SWAP Columns in Hierarchical indexing

In [ ]:
df7

In [ ]:
df8=df7.set_index(['Year', 'Literacy/GDP'])
df8

In [ ]:
# Swaping the columns in Hierarchical index
df9 = df8.swaplevel('Year', 'Literacy/GDP')
df9

In [ ]:
# Swaping the columns in Hierarchical index
df9 = df9.swaplevel('Year', 'Literacy/GDP')
df9

# Crosstab in Pandas

In [ ]:
df7

In [ ]:
pd.crosstab(df7['Literacy/GDP'] , df7.Value , margins=True)

In [ ]:
# 2 way cross table
pd.crosstab(df7.Year , df7['Literacy/GDP'] , margins=True)

In [ ]:
# 3 way cross table
pd.crosstab([df7.Year , df7['Literacy/GDP']] , df7.Country, margins=True)

# Row & Column Bind

### Row Bind

In [ ]:
df8 = pd.DataFrame({'ID' :[1,2,3,4] ,  'Name' :['Asif' , 'Basit' , 'Ross' , 'John'] , 'Score' :[99 , 66 , 44 , 33]})
df8

In [ ]:
df9 = pd.DataFrame({'ID' :[5,6,7,8] ,  'Name' :['Michelle' , 'Ramiro' , 'Vignesh' , 'Damon'] , 'Score' :[78 , 54 , 77 , 87]})
df9

In [ ]:
# Row Bind with concat() function
pd.concat([df8 , df9])

In [ ]:
# Row Bind with append() function
df8.append(df9)

### Column Bind

In [ ]:
df10 = pd.DataFrame({'ID' :[1,2,3,4] , 'Name' :['Asif' , 'Basit' , 'Ross' , 'John']})
df10

In [ ]:
df11 = pd.DataFrame({'Age' :[20,30,35,40] , 'Score' :[99 , 66 , 44 , 33]})
df11

In [ ]:
pd.concat([df10,df11] , axis = 1)